#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.infrastructure.module.container_registries.kubernetes_secret.kubernetes_user_secret will be created
  + resource "kubernetes_secret" "kubernetes_user_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "aws"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_database_firewall.allow_kubernetes will be created
  + resource "digitalocean_database_firewall" "allow_kubernetes" {
      + cluster_id = "9773e3f6-9131-454f-b9f7-ac6cd1fb8c9e"
      + id         = (known after apply)

      + rule {
          + created_at = (known after apply)
          + type       = "k8s"
          + uuid       = (known after apply)
          + value      = "a5be20d1-0248-460b-a1e1-355d6a5a8c64"
        }
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_database_firewall.allow_kubernetes_to_redis will be created
  + resource "digitalocean_database_firewall" "allow_kubernetes_to_redis" {
      + cluster_id = "ed6d0b89-2536-4455-a2ea-56b157ed9bc4"
      + id         = (known after apply)

      + rule {
          + created_at = (known after apply)
          + type       = "k8s"
          + uuid       = (known after apply)
          + value      = "a5be20d1-0248-460b-a1e1-355d6a5a8c64"
        }
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.kubernetes_secret.api_database_credentials will be created
  + resource "kubernetes_secret" "api_database_credentials" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "api-database-credentials"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.kubernetes_secret.language_service_cache_credentials will be created
  + resource "kubernetes_secret" "language_service_cache_credentials" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "language-service-cache-credentials"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.kubernetes_config.helm_release.cert_manager will be created
  + resource "helm_release" "cert_manager" {
      + atomic                = false
      + chart                 = "cert-manager"
      + cleanup_on_fail       = false
      + dependency_update     = false
      + disable_crd_hooks     = false
      + disable_webhooks      = false
      + force_update          = false
      + id                    = (known after apply)
      + max_history           = 0
      + metadata              = (known after apply)
      + name                  = "cert-manager"
      + namespace             = "cert-manager"
      + recreate_pods         = false
      + render_subchart_notes = true
      + replace               = false
      + repository            = "https://charts.jetstack.io"
      + reset_values          = false
      + reuse_values          = false
      + skip_crds             = false
      + status                = "deployed"
      + timeout               = 300
      + verify                = false
      + version               = "v0.13.1"
      + wait                  = true
    }

  # module.infrastructure.module.kubernetes_config.helm_release.nginx_ingress will be created
  + resource "helm_release" "nginx_ingress" {
      + atomic                = false
      + chart                 = "nginx-ingress"
      + cleanup_on_fail       = false
      + dependency_update     = false
      + disable_crd_hooks     = false
      + disable_webhooks      = false
      + force_update          = false
      + id                    = (known after apply)
      + max_history           = 0
      + metadata              = (known after apply)
      + name                  = "nginx-ingress"
      + namespace             = "default"
      + recreate_pods         = false
      + render_subchart_notes = true
      + replace               = false
      + repository            = "https://kubernetes-charts.storage.googleapis.com/"
      + reset_values          = false
      + reuse_values          = false
      + skip_crds             = false
      + status                = "deployed"
      + timeout               = 300
      + verify                = false
      + version               = "1.33.0"
      + wait                  = true
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_namespace.cert_manager will be created
  + resource "kubernetes_namespace" "cert_manager" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "cert-manager"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_namespace.logging will be created
  + resource "kubernetes_namespace" "logging" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "logging"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_secret.api_secret_key_base will be created
  + resource "kubernetes_secret" "api_secret_key_base" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "api-secret-key-base"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_secret.local_connection_token will be created
  + resource "kubernetes_secret" "local_connection_token" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "local-connection-token"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.kubernetes_config.random_password.api_secret_key_base will be created
  + resource "random_password" "api_secret_key_base" {
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.infrastructure.module.kubernetes_config.random_password.local_connection_token will be created
  + resource "random_password" "local_connection_token" {
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "api_secret_key_base" but a
value was found in file "/terraform/terraform.tfvars". To use this value, add
a "variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.

```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
